; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v1)
		(pred_6 ?v3)
		(pred_4 ?v6)
		(pred_1 ?v6)
		(pred_2 ?v3 ?v6)
		(pred_5)
		(pred_3 ?v3))

   (:action op_2
       :parameters  (?v2 ?v4)
       :precondition (and (not-eq ?v2 ?v4) 
                          (pred_4 ?v2) (pred_4 ?v4) (pred_1 ?v2))
       :effect (and  (pred_1 ?v4)
		     (not (pred_1 ?v2))))


   (:action op_3
       :parameters (?v7 ?v5)
       :precondition  (and  (pred_6 ?v7) (pred_4 ?v5)
			    (pred_2 ?v7 ?v5) (pred_1 ?v5) (pred_5))
       :effect (and (pred_3 ?v7)
		    (not (pred_2 ?v7 ?v5)) 
		    (not (pred_5))))

   (:action op_1
       :parameters  (?v7  ?v5)
       :precondition  (and  (pred_6 ?v7) (pred_4 ?v5)
			    (pred_3 ?v7) (pred_1 ?v5))
       :effect (and (pred_2 ?v7 ?v5)
		    (pred_5)
		    (not (pred_3 ?v7)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_08 obj_04 obj_05 obj_03 obj_07 obj_09 
          obj_02 obj_01 obj_06 
)
(:init
(pred_4 obj_08)
(pred_4 obj_04)
(pred_4 obj_05)
(pred_4 obj_03)
(pred_4 obj_07)
(pred_4 obj_09)
(pred_6 obj_02)
(pred_6 obj_01)
(pred_6 obj_06)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_07)
(pred_5)
(pred_2 obj_02 obj_05)
(pred_2 obj_01 obj_07)
(pred_2 obj_06 obj_05)
(pred_1 obj_09)
)
(:goal
(and
(pred_2 obj_02 obj_03)
(pred_2 obj_01 obj_07)
(pred_2 obj_06 obj_09)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_02 obj_03) (pred_1 obj_08))
    (sometime-before  (pred_2 obj_06 obj_09) (pred_1 obj_08))
  )
)
)

; plan
1. (op_2 obj_09 obj_05)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_05)
   goals met: 1 of 3
2. (op_3 obj_06 obj_05)
   deleted: (pred_2 obj_06 obj_05) (pred_5)
   added: (pred_3 obj_06)
   goals met: 1 of 3
3. (op_2 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_03)
   goals met: 1 of 3
4. (op_1 obj_06 obj_03)
   deleted: (pred_3 obj_06)
   added: (pred_2 obj_06 obj_03) (pred_5)
   goals met: 1 of 3
5. (op_2 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_05)
   goals met: 1 of 3
6. (op_3 obj_02 obj_05)
   deleted: (pred_2 obj_02 obj_05) (pred_5)
   added: (pred_3 obj_02)
   goals met: 1 of 3
7. (op_2 obj_05 obj_08)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_08)
   goals met: 1 of 3
8. (op_1 obj_02 obj_08)
   deleted: (pred_3 obj_02)
   added: (pred_2 obj_02 obj_08) (pred_5)
   goals met: 1 of 3
9. (op_2 obj_08 obj_03)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_03)
   goals met: 1 of 3
10. (op_3 obj_06 obj_03)
   deleted: (pred_2 obj_06 obj_03) (pred_5)
   added: (pred_3 obj_06)
   goals met: 1 of 3
11. (op_2 obj_03 obj_09)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_09)
   goals met: 1 of 3
12. (op_1 obj_06 obj_09)
   deleted: (pred_3 obj_06)
   added: (pred_2 obj_06 obj_09) (pred_5)
   goals met: 2 of 3
13. (op_2 obj_09 obj_08)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_08)
   goals met: 2 of 3
14. (op_3 obj_02 obj_08)
   deleted: (pred_2 obj_02 obj_08) (pred_5)
   added: (pred_3 obj_02)
   goals met: 2 of 3
15. (op_2 obj_08 obj_03)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_03)
   goals met: 2 of 3
16. (op_1 obj_02 obj_03)
   deleted: (pred_3 obj_02)
   added: (pred_2 obj_02 obj_03) (pred_5)
   goals met: 3 of 3
